/*
a+1是二维数组1行的首地址，等于1008。a[1]是第二个一维数组的数组名和首地址，因此也为1008。
&a[1][0]是二维数组a的1行0列元素地址，也是1008。因此a+1,a[1],*(a+1),&a[1][0]是等同的。

由此可得出：a+i，a[i]，*(a+i)，&a[i][0]是等同的。

此外，&a[i]和a[i]也是等同的。因为在二维数组中不能把&a[i]理解为元素a[i]的地址，不存在元素a[i]。
C语言规定，它是一种地址计算方法，表示数组a第i行首地址。由此，我们得出：a[i]，&a[i]，*(a+i)和a+i也都是等同的。

另外，a[0]也可以看成是a[0]+0，是一维数组a[0]的0号元素的首地址，而a[0]+1则是a[0]的1号元素首地址，
由此可得出a[i]+j则是一维数组a[i]的j号元素首地址，它等于&a[i][j]。

由a[i]=*(a+i)得a[i]+j=*(a+i)+j。由于*(a+i)+j是二维数组a的i行j列元素的地址，所以，该元素的值等于*(*(a+i)+j)。
*/

#include<stdio.h>

main(){
	int a[3][4] = {0,1,2,3,4,5,6,7,8,9,10,11};
	printf("%d,",a);
	printf("%d,",*a);
	printf("%d,",a[0]);
	printf("%d,",&a[0]);
	printf("%d\n",&a[0][0]);

	printf("%d,",a+1);
    printf("%d,",*(a+1));
    printf("%d,",a[1]);
    printf("%d,",&a[1]);
    printf("%d\n",&a[1][0]);

    printf("%d,",a+2);
    printf("%d,",*(a+2));
    printf("%d,",a[2]);
    printf("%d,",&a[2]);
    printf("%d\n",&a[2][0]);

    printf("%d,",a[1] + 1);
    printf("%d\n",*(a+1)+1);
    printf("%d,%d\n",*(a[1]+1), *(*(a+1)+1));
}